Revit 2015 API
ExporterIFC.GetBuilding Method
 Gets the global IfcBuilding object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2013
Syntax
C#
[ObsoleteAttribute("This handle is no longer used by native code.")]
public IFCAnyHandle GetBuilding()
Visual Basic
<ObsoleteAttribute("This handle is no longer used by native code.")> _
Public Function GetBuilding As IFCAnyHandle
Visual C++
[ObsoleteAttribute(L"This handle is no longer used by native code.")]
public:
IFCAnyHandle^ GetBuilding()
Return Value
 The handle.
See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace